{"doc":{"ln":{"SYNOPSIS":"ln [options] source [dest]\n",
"s":"Créer des liens symboliques à la place des liens physiques.\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"Sous Unix, il existe deux types de `liens' entre fichiers, que l'on nomme généralement liens matériels (ou physiques) et liens symboliques (ou logiques). Sous Unix, il existe deux types de `liens' entre fichiers, que l'on nomme généralement liens matériels (ou physiques) et liens symboliques (ou logiques). Un lien matériel est simplement une manière de  nommer  un fichier. Un fichier peut avoir plusieurs noms. Un fichier n'est effacé réellement que lorsque son  dernier  nom  est supprimé. Le nombre de noms d'un fichier est indiqué par la commande ls(1). Il n'y a pas de notion de nom `original' : Tous les noms d'un fichier ont exactement la même importance. Tous les noms d'un fichier se trouvent généralement dans le système de fichiers contenant les données du fichier. Un lien symbolique est d'un tout autre genre. Il s'agit d'un petit fichier spécial, qui contient un chemin d'accès. Ainsi un lien symbolique peut pointer vers un système de fichier différent de celui qui l'accueille. Avec un appel rm(1)le lien lui-même est supprimé, et non pas le fichier visé. ln crée des liens entre fichiers. Par défaut il s'agit de liens matériels.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"n - Créer des liens entre fichiers.\n"}
,"ls":{"SYNOPSIS":"ls [options] [fichier...]\n",
"a":"Afficher tous les fichiers des répertoires, y  compris les fichiers commençant par un `.'.",
"SEE_ALSO":"WIP",
"DESCRIPTION":"La commande ls affiche tout d'abord l'ensemble de ses arguments fichiers autres que des répertoires. Puis ls affiche l'ensemble des fichiers contenus dans chaque répertoire indiqué. Si aucun argument (autre qu'une option) n'est fourni, le contenu du répertoire en cours est affiché. Le contenu des répertoires est trié par ordre alphabétique.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"l":"En  plus  du  nom, afficher le type du fichier, les permissions d'accès, le nombre de liens physiques, le  nom  du propriétaire et du groupe, la taille en octets, et l'horodatage. Pour les fichiers vieux de plus de 6 mois, ou en avance sur la date de plus d'une heure, l'horodatage contient l'année à la place de l'heure.\n",
"NAME":"ls - Afficher le contenu d'un répertoire.\n"}
,"nano":{"A":"WIP",
"B":"WIP",
"E":"WIP",
"H":"WIP",
"AUTHOR":"WIP",
"L":"WIP",
"R":"WIP",
"T":"WIP",
"DESCRIPTION":"nano est éditeur de texte gratuit qui a pour but de remplacer Pico l'éditeur de texte par défaut. Plutôt que de simplement le copier, nano implémente certaines fonctionnalités manquantes de Pico, comme \"rechercher et remplacer\" ou encore \"aller à la ligne et à la colonne numéro :\".\n",
"Y":"WIP",
"REPORTING_BUGS":"WIP",
"Z":"WIP",
"c":"WIP",
"e":"WIP",
"i":"WIP",
"k":"WIP",
"l":"WIP",
"NAME":"nano – nano est éditeur de texte , c'est une version gratuite et améliorée de Pico.\n",
"p":"WIP",
"SYNOPSIS":"nano [fichier]\n",
"SEE_ALSO":"WIP",
"t":"WIP",
"v":"WIP",
"w":"WIP",
"x":"WIP",
"y":"WIP",
"COPYRIGHT":"WIP"}
,"echo":{"SYNOPSIS":"echo [message ...]\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"echo écrit chaque message sur la sortie standard, avec un espace entre  chacun  d'eux, et un saut de ligne après le dernier.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"echo - Afficher une ligne de texte.\n"}
,"rmdir":{"SYNOPSIS":"rmdir [options] [répertoire...]\n",
"r":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"rmdir  supprime  chaque  répertoire  vide indiqué.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"rmdir - Supprimer des répertoires vides.\n"}
,"unset":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"music":{"p":"WIP",
"SYNOPSIS":"WIP",
"r":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"x":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"l":"WIP",
"NAME":"WIP",
"o":"WIP"}
,"find":{"SYNOPSIS":"find [chemin...] [expression]\n",
"t":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"find parcourt les arborescences de répertoires  commençant en chacun des chemins mentionnés, en évaluant les expressions fournies pour chaque fichier rencontré.\n",
"u":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"l":"WIP",
"n":"WIP",
"NAME":"find  -  Rechercher  des  fichiers  dans une hiérarchie de répertoires.\n"}
,"enable":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"mkdir":{"SYNOPSIS":"mkdir repertoire...\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"mkdir crée un répertoire correspondant à chacun des noms mentionnés.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"mkdir - Créer des répertoires.\n"}
,"read":{"SYNOPSIS":"#include <sys/types.h>\n#include <unistd.h>\n\nssize_t read(int fd, void *buf, size_t count);\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"read lit jusqu'à count octets depuis le descripteur de fichier fd dans le buffer pointé par buf. Si count vaut zéro, read renvoie zéro et n'a pas d'autres effets. Si count est supérieur à SSIZE_MAX, le résultat est indéfini.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"read - Lire le contenu d'un fichier.\n"}
,"test":{"SYNOPSIS":"test [expr]\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"test renvoie une valeur 0 (vrai) ou 1 (faux) suivant l'évaluation de l'expression conditionnelle expr.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"test - Vérifier le type d'un fichier, et comparer des valeurs.\n"}
,"var":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"mv":{"SYNOPSIS":"mv [option...] source cible\n",
"r":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"Si le dernier argument est le nom d'un répertoire existant, mv placera tous les autres fichiers à l'intérieur de ce répertoire, en conservant leurs noms. Sinon, s'il n'y a que deux fichiers indiqués, il déplacera le premier pour remplacer le second.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"mv - Déplacer ou renommer des fichiers.\n"}
,"touch":{"SYNOPSIS":"touch fichier...\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"touch modifie la date d'accès et la date  de  modification de chaque fichier indiqué. Ces  horodatages  sont  remplacés  par  la date et l'heure actuelles.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"touch - Modifier l'horodatage d'un fichier.\n"}
,"history":{"SYNOPSIS":"history\n",
"c":"Vider l'historique",
"s":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"de nombreux programmes lisent les entrées de l'utilisateur ligne par ligne. La bibliothèque linux History est capable de garder en mémoire ces lignes, associer des données arbitraires à des lignes, et utiliser les informations des lignes précédentes pour en composer de nouvelles.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"history – Bibliothèque linux history.\n"}
,"users":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"exit":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"true":{"SYNOPSIS":"true",
"SEE_ALSO":"WIP",
"DESCRIPTION":"true ne fait rien d'autre que renvoyer un code de retour valant 0, signifiant ``réussite''. Il peut être utilisé pour remplir un shell script lorsqu'une commande réussie est nécessaire\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"true - réussir à ne rien faire.\n"}
,"rm":{"SYNOPSIS":"rm fichier...\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"rm  efface chaque fichier indiqué. Par défaut, il n'efface pas les répertoires.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"rm - Effacer des fichiers\n"}
,"pwd":{"SYNOPSIS":"pwd",
"SEE_ALSO":"WIP",
"DESCRIPTION":"pwd affiche le nom complet du répertoire en cours.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"pwd - Afficher le nom du répertoire de travail en cours.\n"}
,"whoami":{"SYNOPSIS":"whoami\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"whoami  affiche  le  nom  d'utilisateur  associé  à l'U-ID effectif en cours.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"whoami - Afficher l'U-ID effectif.\n"}
,"cut":{"SYNOPSIS":"cut {-f liste_champs} [-d séparateur]",
"d":"Avec -f, les champs sont délimités par le premier caractère du séparateur à la place de la Tabulation.",
"SEE_ALSO":"WIP",
"DESCRIPTION":"cut affiche une partie de chaque ligne de chacun des fichiers mentionnés, ou de l'entrée standard si aucun fichier n'est indiqué. Un nom de fichier `-' correspond également à l'entrée standard.\n",
"f":"N'afficher que les champs indiqués dans la liste_de_champs. Les champs sont séparés, par défaut, par une Tabulation.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"cut - Supprimer une partie de chaque ligne d'un fichier.\n"}
,"chgrp":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"import":{"SYNOPSIS":"WIP",
"b":"WIP",
"SEE_ALSO":"WIP",
"t":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"save":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"wc":{"SYNOPSIS":"wc [-clwm] [fichier...]\n",
"c":"Afficher uniquement le nombre d'octets.\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"wc compte le nombre d'octets, de mots séparés par des blancs, et de sauts de lignes dans chacun des fichiers indiqués. Une ligne de statistiques est affichée pour chaque fichier, précédée du nom du fichier s'il a été indiqué en argument. Si plusieurs fichiers sont mentionnés, wc ajoute une ligne finale de statistiques, contenant le cumul des valeurs, précédé du nom `total'. Les statistiques sont affichées dans l'ordre suivant : nombre de lignes, de mots, et d'octets.\n",
"w":"Afficher uniquement le nombre de mots.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"l":"Afficher uniquement le nombre de sauts de lignes.\n",
"m":"Afficher le nombre de caractères\n",
"NAME":"wc - Afficher le nombre d'octets, de mots et de lignes d'un fichier.\n"}
,"useradd":{"p":"WIP",
"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"G":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"sleep":{"SYNOPSIS":"sleep number[smhd]...",
"SEE_ALSO":"WIP",
"DESCRIPTION":"sleep fait une pause pendant une durée correspondant à la somme des valeurs indiquées sur la ligne de commande. Chaque argument est composé d'un nombre suivi éventuellement d'une unité. L'unité par défaut est la seconde. Les unités reconnues sont :\n\ns\nsecondes\nm\nminutes\nh\nheures\nd\njours\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"sleep - Attendre une durée déterminée.\n"}
,"sed":{"SYNOPSIS":"sed [fichier-d-entrée]...\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"sed est un éditeur de flux. Un éditeur de flux est utilisé pour effectuer des transformations de texte basiques sur un flux d'entrée (un fichier ou l'entrée d'un tube).\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"sed - Éditeur de flux pour le filtrage et la transformation de texte.\n"}
,"cat":{"SYNOPSIS":"cat [fichier...]",
"SEE_ALSO":"WIP",
"DESCRIPTION":"cat  affiche  sur  la sortie standard le contenu de chacun des fichiers indiqués.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"cat - Concaténer des fichiers et les afficher sur la sortie standard.\n"}
,"alias":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"définir ou afficher des alias. Dans le cas ou l'on appelle la fonction sans arguments, tous les alias déjà existants sont affichés sur la sortie standard sous la forme de `alias NOM=VALEUR'. Autrement un alias est défini pour chaque NOM pour lequel une VALEUR est donnée.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"alias – définir ou afficher des alias.\n"}
,"chmod":{"SYNOPSIS":"chmod mode fichier...\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"chmod modifie les permissions d'accès de chacun des fichiers indiqués, en suivant l'indication de mode, qui peut être une représentation symbolique du changement à effectuer, ou un nombre octal représentant le motif binaire des nouvelles autorisations. Le format symbolique des changements de mode est `[ugoa...][[+-=][rwxXstugo...]...][,...]'. Plusieurs opérations symboliques peuvent être séparées par des virgules. Une combinaison des lettres `ugoa' contrôle la catégorie d'accès à modifier. Il peut s'agir de l'utilisateur possédant le fichier (u), des autres utilisateurs du même groupe que le fichier (g), des utilisateurs n'appartenant pas au groupe du fichier (o), ou de tous les utilisateurs (a). Si aucune catégorie n'est indiquée, l'ensemble (a) est pris par défaut, mais les bits correspondant à des bits à 1 du mask ne sont pas affectés. L'opérateur `+' autorise un accès, l'opérateur `-' interdit un accès, et l'opérateur `=' autorise exclusivement l'accès indiqué. Les lettres `rwxXstugo' sélectionne le type d'autorisation concernée : r lecture, w écriture, x exécution (ou parcours pour les répertoires), X exécution, uniquement si le fichier est un répertoire, ou s'il a déjà une autorisation d'exécution pour une des catégories d'utilisateur (s'il s'agit donc bien d'un fichier exécutable), s utiliser l'ID du propriétaire ou du groupe propriétaire du fichier lors de l'exécution, t (sticky-bit) conserver le code du programme sur le périphérique de swap après exécution. Non documenté par POSIX, il s'agit du comportement original, mais de nos jours il sert uniquement pour les répertoires. Il indique que seuls le propriétaire du répertoire, et le propriétaire d'un fichier qui s'y trouve ont le droit de supprimer ce fichier. C'est typiquement utilisé pour les répertoires comme /tmp ayant une autorisation d'écriture générale. u les permissions dont dispose actuellement le propriétaire du fichier, g les permissions dont disposent actuellement les autres membres du groupe propriétaire du fichier, o les permissions dont disposent tous les autres utilisateurs. Une valeur numérique pour le mode est constituée de 1 à 4 chiffres en octal (0 a 7), calculés en additionnant les bits de valeurs 4, 2, et 1. Un bit non mentionné étant considéré comme nul. Le premier chiffre correspond aux attributs Set-UID (4), Set-GID (2), et conservation du code en mémoire [`sticky bit'] (1). Le second chiffre correspond aux autorisations de lecture (4), écriture (2) et exécution pour l'utilisateur propriétaire du fichier. Les troisième et quatrième chiffres correspondent respectivement aux autorisations d'accès pour les membres du groupe du fichier, et pour les autres utilisateurs.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"chmod - Modifier les autorisations d'accès à un fichier.\n"}
,"man":{"SYNOPSIS":"man nom...\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"man formate et affiche les pages de manuel en ligne. Nom est normalement le nom de la page de manuel, qui est typiquement celui d'une commande, dans le cadre de cette application le manuel est une traduction et simplification du manuel présent sous Linux.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"man - formater et afficher les pages de manuel en ligne.\n"}
,"sudo":{"SYNOPSIS":"sudo",
"SEE_ALSO":"WIP",
"DESCRIPTION":"sudo permet à un utilisateur ayant la permission d'exécuter une commande en tant qu'administrateur.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"sudo - exécute une commande en tant qu'un autre utilisateur.\n"}
,"escape":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"cd":{"SYNOPSIS":"cd [chemin]\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"cd change le répertoire de travail. En l’absence d’arguments, le nouveau répertoire de travail est la valeur de la variable HOME.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"cd − change le répertoire de travail.\n"}
,"su":{"SYNOPSIS":"su [--l] [utilisateur [arg...]]",
"SEE_ALSO":"WIP",
"DESCRIPTION":"su permet à un utilisateur de se transformer temporairement en un autre utilisateur. Si aucun nom d'utilisateur n'est mentionné, le nom root, le Super-Utilisateur, est utilisé par défaut. Si l'utilisateur dispose d'un mot de passe, su le réclame, à moins qu'il n'ait été invoque avec un UID réel valant 0 (celui du Super-Utilisateur).\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"l":"Appelle le shell sous forme de shell de connexion.",
"NAME":"su - Exécuter un shell avec un User-ID et un Group-ID différents.\n"}
,"grep":{"SYNOPSIS":"grep motif [ fichiers... ]\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"grep recherche dans les fichiers d'entrée indiqués les lignes correspondant à un certain motif. Par défaut, grep affiche les lignes correspondant au motif.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"grep - Afficher les lignes correspondant à un motif donné.\n"}
,"clear":{"SYNOPSIS":"clear",
"SEE_ALSO":"WIP",
"DESCRIPTION":"clear efface votre écran si c'est possible. Il recherche dans l'environnement le type du terminal, et consulte ensuite la base de données terminfo pour déterminer la façon de procéder.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"clear - effacer l'écran du terminal.\n"}
,"false":{"SYNOPSIS":"false",
"SEE_ALSO":"WIP",
"DESCRIPTION":"false ne fait rien, mais renvoie un code de retour valant 1, signifiant ``échec''. Il peut être utilisé pour prendre la place d'une commande devant échouer dans un script shell (pour la mise au point par exemple).\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"false – échouer en ne faisant rien.\n"}
,"groups":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"groupadd":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"clean":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"cp":{"SYNOPSIS":"cp [options] fichier... répertoire\n",
"r":"Copier récursivement les répertoires mais la gestion des fichiers spéciaux n'est pas définie.\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"cp sert à copier des fichiers (et éventuellement des répertoires). On peut aussi bien copier un fichier donné vers une destination précise que copier un ensemble de fichiers dans un répertoire. Si le dernier argument correspond à un nom de répertoire, cp copie dans ce répertoire chaque fichier indiqué en conservant le même nom. Sinon, s'il n'y a que deux fichiers indiqués, il copie le premier sur le second.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"cp - Copier des fichiers.\n"}
,"help":{"SYNOPSIS":"help",
"SEE_ALSO":"WIP",
"DESCRIPTION":"help n'est pas une fonction unix, elle permet d'afficher les commandes utilisables par l'utilisateur dans le challenge en cours.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"help – Affiche la liste des commandes disponibles.\n"}
,"adduser":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"disable":{"SYNOPSIS":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"WIP"}
,"bash":{"SYNOPSIS":"bash [fichier]\n",
"SEE_ALSO":"WIP",
"DESCRIPTION":"bash est un interpréteur (Shell) qui exécute les  commandes lues depuis l'entrée standard, ou depuis un fichier.\n",
"i":"Si l'option -i est présente, l'interpréteur est interactif.\n",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"NAME":"bash - Interpréteur de commandes GNU Bourne-Again Shell.\n"}
,"font":{"SYNOPSIS":"WIP",
"s":"WIP",
"SEE_ALSO":"WIP",
"DESCRIPTION":"WIP",
"REPORTING_BUGS":"WIP",
"COPYRIGHT":"WIP",
"AUTHOR":"WIP",
"l":"WIP",
"NAME":"WIP"}}}